tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "johanhaleby/kubetail"
tap "k14s/tap"
tap "mongodb/brew"
tap "schniz/tap"
tap "weaveworks/tap"
# Search tool like grep, but optimized for programmers
brew "ack"
# YAML Parser
brew "libyaml"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Integrated shell for working with the AWS CLI
brew "aws-shell"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Control the macOS dark mode from the command-line
brew "dark-mode"
# Fast and simple Node.js version manager
brew "fnm"
# Gatsby command-line interface
brew "gatsby-cli"
# Distributed revision control system
brew "git"
# Alternative to top/htop
brew "glances"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Kubernetes package manager
brew "helm"
# Add GitHub support to git on the command-line
brew "hub"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli", link: false
# X.509 and CMS library
brew "libksba"
# Generic library support script
brew "libtool"
# Mac App Store command-line interface
brew "mas"
# Port scanning utility for large networks
brew "nmap"
# Manage compile and link flags for libraries
brew "pkg-config"
# Object-relational database system
brew "postgresql@11"
# Function As A Service on top of Kubernetes, riff is for functions
brew "riff"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Cross-shell prompt for astronauts
brew "starship"
# Programatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Tail logs from multiple Kubernetes pods at the same time
brew "johanhaleby/kubetail/kubetail", args: ["with-short-names"]
# Kapp
brew "k14s/tap/kapp"
# YAML Templating Tool
brew "k14s/tap/ytt"
# The official CLI for Amazon EKS
brew "weaveworks/tap/eksctl"
cask "adoptopenjdk8"
cask "aerial"
cask "camtasia"
cask "discord"
cask "docker"
cask "firefox"
cask "firefox-developer-edition"
cask "font-firacode-nerd-font"
cask "font-firacode-nerd-font-mono"
cask "google-chrome"
cask "google-cloud-sdk"
cask "iterm2"
cask "microsoft-edge"
cask "plex-media-server"
cask "postman"
cask "rectangle"
cask "robo-3t"
cask "sdformatter"
cask "slack"
cask "udeler"
cask "visual-studio-code"
mas "Xcode", id: 497799835
